import re
from faker import Faker


fake = Faker()


ip = 'hdfhkfdskhdkhsdflhk 192.0.2.235 fhkkhsfdk 145.12.55.233'
ip4 = re.compile(r"""
    (?:(?:25[0-5]| # 250-255
          2[0-4][0-9]|  # 200-249
          [01]?[0-9]?[0-9])\.){3}
          (?:25[0-5]|2[0-4][0-9]|[01]?[0-9]?[0-9])
""", re.VERBOSE)


test_url ='fgsdfgjl fsadf  https://vk.com fsdf ag  ' + str(fake.url())
url = re.compile(r'https?://[\S]+')

test_email = str(fake.email())
email = re.compile(r'[a-zA-Z0-9_.+-]+@[a-zA-Z0-9-]+\.[a-zA-Z0-9-.]+')

test_phone = str(f'+7 ({fake.msisdn()[3:6]})-{fake.msisdn()[6:9]}-{fake.msisdn()[9:11]}-{fake.msisdn()[11:13]}')
phone = re.compile(r'\+7\s\([0-9]{3}\)-[0-9]{3}-[0-9]{2}-[0-9]{2}')

test_bank = 'gdsfgsdfg 4444 fff 7777 5555 6666 2222'
bank = re.compile(r'\d{4}\s\d{4}\s\d{4}\s\d{4}')

a = str(fake.ipv6())
print(a)
test_ipv6 = a + '2607:G8B0:4010:801::1004'
# ipv6 = re.compile(r"(([0-9a-fA-F]{1,4}:){7,7}[0-9a-fA-F]{1,4}|([0-9a-fA-F]{1,4}:){1,7}:|([0-9a-fA-F]{1,4}:){1,6}:[0-9a-fA-F]{1,4}|([0-9a-fA-F]{1,4}:){1,5}(:[0-9a-fA-F]{1,4}){1,2}|([0-9a-fA-F]{1,4}:){1,4}(:[0-9a-fA-F]{1,4}){1,3}|([0-9a-fA-F]{1,4}:){1,3}(:[0-9a-fA-F]{1,4}){1,4}|([0-9a-fA-F]{1,4}:){1,2}(:[0-9a-fA-F]{1,4}){1,5}|[0-9a-fA-F]{1,4}:((:[0-9a-fA-F]{1,4}){1,6})|:((:[0-9a-fA-F]{1,4}){1,7}|:)|fe80:(:[0-9a-fA-F]{0,4}){0,4}%[0-9a-zA-Z]{1,}|::(ffff(:0{1,4}){0,1}:){0,1}((25[0-5]|(2[0-4]|1{0,1}[0-9]){0,1}[0-9])\.){3,3}(25[0-5]|(2[0-4]|1{0,1}[0-9]){0,1}[0-9])|([0-9a-fA-F]{1,4}:){1,4}:((25[0-5]|(2[0-4]|1{0,1}[0-9]){0,1}[0-9])\.){3,3}(25[0-5]|(2[0-4]|1{0,1}[0-9]){0,1}[0-9]))")
# ipv6 = re.compile(r"(([0-9a-fA-F]{1,4}:){7,7}[0-9a-fA-F]{1,4}|([0-9a-fA-F]{1,4}:){1,7}:|([0-9a-fA-F]{1,4}:){1,6}:[0-9a-fA-F]{1,4}|([0-9a-fA-F]{1,4}:){1,5}(:[0-9a-fA-F]{1,4}){1,2}|([0-9a-fA-F]{1,4}:){1,4}(:[0-9a-fA-F]{1,4}){1,3}|([0-9a-fA-F]{1,4}:){1,3}(:[0-9a-fA-F]{1,4}){1,4}|([0-9a-fA-F]{1,4}:){1,2}(:[0-9a-fA-F]{1,4}){1,5}|[0-9a-fA-F]{1,4}:((:[0-9a-fA-F]{1,4}){1,6})|:((:[0-9a-fA-F]{1,4}){1,7}|:)|fe80:(:[0-9a-fA-F]{0,4}){0,4}%[0-9a-zA-Z]{1,}|::(ffff(:0{1,4}){0,1}:){0,1}((25[0-5]|(2[0-4]|1{0,1}[0-9]){0,1}[0-9])\.){3,3}(25[0-5]|(2[0-4]|1{0,1}[0-9]){0,1}[0-9])|([0-9a-fA-F]{1,4}:){1,4}:((25[0-5]|(2[0-4]|1{0,1}[0-9]){0,1}[0-9])\.){3,3}(25[0-5]|(2[0-4]|1{0,1}[0-9]){0,1}[0-9]))")
# ipv6 = re.compile('/^(?>(?>([a-f0-9]{1,4})(?>:(?1)){7}|(?!(?:.*[a-f0-9](?>:|$)){8,})((?1)(?>:(?1)){0,6})?::(?2)?)|(?>(?>(?1)(?>:(?1)){5}:|(?!(?:.*[a-f0-9]:){6,})(?3)?::(?>((?1)(?>:(?1)){0,4}):)?)?(25[0-5]|2[0-4][0-9]|1[0-9]{2}|[1-9]?[0-9])(?>\.(?4)){3}))$/iD')

def task():
    print(ip4.findall(ip))
    print(url.findall(test_url))
    print(email.findall(test_email))
    print(phone.findall(test_phone))
    print(bank.findall(test_bank))
    # print(ipv6.findall(test_ipv6))


if __name__ == "__main__":
    task()# Write your solution here
    pass



"""
Валидация url
Валидация валидация email
Валидация сотового номера телефона '+7 (000) 000-00-00'
Валидация номера банковской карты '0000 0000 0000 0000'
* Валидация ip4 + ip6
"""
